tap "badabing2005/pixelflasher"
tap "macos-fuse-t/cask"
brew "lz4"
brew "xz"
brew "apktool"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "openssl@3"
brew "bat"
brew "ccache"
brew "cmake"
brew "code2prompt"
brew "readline"
brew "sqlite"
brew "doctl"
brew "python@3.14"
brew "dotdrop"
brew "dust"
brew "exiftool"
brew "eza"
brew "ffmpeg"
brew "firefoxpwa"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "gitingest"
brew "pinentry"
brew "gnupg"
brew "libtool"
brew "imagemagick"
brew "jq"
brew "llvm@20"
brew "micro"
brew "nasm"
brew "ncdu"
brew "ninja"
brew "node"
brew "ox"
brew "pandoc"
brew "pkgconf"
brew "powerlevel10k"
brew "pure"
brew "ripgrep"
brew "scrcpy"
brew "starship"
brew "syncthing", restart_service: :changed
brew "tcl-tk"
brew "tldr"
brew "tmux"
brew "tree"
brew "unar"
brew "uv"
brew "wget"
brew "xsel"
brew "yt-dlp"
brew "zlib"
brew "zoxide"
cask "affine"
cask "alacritty"
cask "android-platform-tools"
cask "bitwarden"
cask "brave-browser"
cask "cyberduck"
cask "db-browser-for-sqlite"
cask "devknife"
cask "devutils"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "forkgram-telegram"
cask "fuse-t"
cask "macos-fuse-t/cask/fuse-t-sshfs"
cask "ghostty"
cask "github"
cask "gpgfrontend"
cask "grandperspective"
cask "iina"
cask "iptvnator"
cask "iterm2"
cask "kitty"
cask "logi-options+"
cask "mac-mouse-fix"
cask "microsoft-edge@beta"
cask "nextcloud"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "spacedrive"
cask "spotify"
cask "swiftdefaultappsprefpane"
cask "termius"
cask "ungoogled-chromium"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "waterfox"
cask "wave"
vscode "batisteo.vscode-django"
vscode "christian-kohler.path-intellisense"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "kevinrose.vsc-python-indent"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "twxs.cmake"
vscode "wholroyd.jinja"
vscode "xiaoluoboding.vscode-folder-size"
vscode "zainchen.json"
